package by.it.nikitko.jd01_12;

class Poem {
    static final String TEXT =
            "У лукоморья дуб зелёный,\n" +
            "Златая цепь на дубе том.\n" +
            "И днём и ночью кот учёный\n" +
            "Всё ходит по цепи кругом.\n" +
            "Идёт направо - песнь заводит,\n" +
            "Идёт направо - песнь заводит,\n" +
            "Идёт направо - песнь заводит,\n" +
            "Идёт\n" +
            "Идёт\n" +
            "Идёт\n" +
            "Идёт направо - песнь заводит,\n" +
            "Идёт направо - песнь заводит";

}
